Revit 2027 API
SpecTypeId.PipeDimension Property
 Pipe Dimension, in discipline Piping.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId PipeDimension { get; }
Public Shared ReadOnly Property PipeDimension As ForgeTypeId
	Get
public:
static property ForgeTypeId^ PipeDimension {
	ForgeTypeId^ get ();
}
static member PipeDimension : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
SpecTypeId Class
Autodesk.Revit.DB Namespace